#เมื่อชื่อโรคแล้วให้เอาชื่อโรคมาเช็คพร้อมกับส่งวิธีการรักษาเ และ ข้อมูลยา สถานที่ซื้อยา

List = ['Sheath Rot Disease',
    'Sheath blight Disease',
    'Bacterial Blight Disease','Leaf Scald Disease',
    'Narrow Brown Spot Disease',
    'Brown Spot Disease',
    'Dirty Panicle Disease']


  
Sheath_Rot_Disease = {
    "Name_TH": "โรคกาบใบเน่า",
    "Name_ENG": "Sheath Rot Disease",
    "Causation": "เชื้อรา Sarocladium oryzae Sawada",
    "Symptoms_TH":"ข้าวแสดงอาการในระยะตั้งท้องโดยเกิดแผลสีน้ำตาลดำบนกาบห่อรวง ขนาดแผลประมาณ 2-7 x 4-18 มิลลิเมตร ตรงกลางแผลมีกลุ่มเส้นใยสีขาวอมชมพู แผลนี้จะขยายติดต่อกันทำให้บริเวณกาบหุ้มรวงมีสีน้ำตาลดำและรวงข้าวส่วนใหญ่โผล่ไม่พ้นกาบหุ้มรวง หรือโผล่ได้บางส่วน ทำให้เมล็ดลีบและมีสีดำ",
    "Symptoms_ENG":"Working in progess...",
    "Protection":[
        "1.ใช้พันธุ์ค่อนข้างต้านทานที่เหมาะสมกับสภาพท้องที่ เช่น กข27 สำหรับนาลุ่มมีน้ำขัง ใช้พันธุ์ข้าวที่ลำต้นสูง แตกกอน้อย",
        "2.ใช้สารป้องกันกำจัดเชื้อรา เช่น แมนโคเซ็บ ตามอัตราที่ระบุ",
        "3.ลดจำนวนประชากรไรขาว พาหะแพร่เชื้อ ในช่วงอากาศแห้งแล้ง ด้วยสารกำจัดไร เช่น ไตรไทออน โอไมท์ ตามอัตราที่ระบุ"
    ],
    "Treatment":"Working in progess...",
    "Source":"http://webold.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=117-1.htm"
}
Sheath_blight_Disease = {
    "Name_TH": "โรคกาบใบแห้ง",
    "Name_ENG": "Sheath blight Disease",
    "Causation": "เชื้อรา Rhizoctonia  solani (Thanatephorus  cucumeris (Frank) Donk)",
    "Symptoms_TH":"เริ่มพบโรคในระยะแตกกอ จนถึงระยะใกล้เก็บเกี่ยว ยิ่งต้นข้าวมีการแตกกอมากเท่าใด ต้นข้าวก็จะเบียดเสียดกันมากขึ้น โรคก็จะเป็นรุนแรง ลักษณะแผลสีเขียวปนเทา ขนาดประมาณ 1-4 x 2-10 มิลลิเมตร ปรากฏตามกาบใบ ตรงบริเวณใกล้ระดับน้ำ แผลจะลุกลามขยายใหญ่ขึ้นจนมีขนาดไม่จำกัดและลุกลามขยายขึ้นถึงใบข้าว ถ้าเป็นพันธุ์ข้าวที่อ่อนแอ แผลสามารถลุกลามถึงใบธงและกาบหุ้มรวงข้าว ทำให้ใบและกาบใบเหี่ยวแห้ง ผลผลิตจะลดลงอย่างมาก",
    "Symptoms_ENG":"Working in progess...",
    "Protection":[
        "1.หลังเก็บเกี่ยวข้าว และเริ่มฤดูใหม่ ควรพลิกไถหน้าดิน เพื่อทำลายส่วนขยายพันธุ์ของเชื้อราสาเหตุโรค",
        "2.กำจัดวัชพืชตามคันนาและแหล่งน้ำ เพื่อลดโอกาสการพักตัวและเป็นแหล่งสะสมของเชื้อราสาเหตุโรค",
        "3.ใช้ชีวภัณฑ์ เช่น เชื้อแบคทีเรีย บาซิลลัส ซับทิลิส (เชื้อแบคทีเรียควบคุมเชื้อสาเหตุโรคพืช) ตามอัตราที่ระบุ",
        "4.ใช้สารป้องกันกำจัดเชื้อรา เช่น วาลิดามัยซิน โพรพิโคนาโซล เพนไซคูรอน หรืออีดิเฟนฟอส ตามอัตราที่ระบุโดยพ่นสารป้องกันกำจัดเชื้อรานี้ในบริเวณที่เริ่มพบโรคระบาด ไม่จำเป็นต้องพ่นทั้งแปลง เพราะโรคกาบใบแห้งจะเกิดเป็นหย่อม"
    ],
    "Treatment":"Working in progess...",
    "Source":"shorturl.at/ghrO9" 
}
Bacterial_Blight_Disease = {
    "Name_TH": "โรคขอบใบแห้ง",
    "Name_ENG": "Bacterial Leaf Blight Disease or Bacterial Blight Disease",
    "Causation": "เชื้อแบคทีเรีย Xanthomonas oryzae pv. oryzae (ex Ishiyama) Swings et al.",
    "Symptoms_TH":"โรคนี้เป็นได้ตั้งแต่ระยะกล้า แตกกอ จนถึงฺ ออกรวง ต้นกล้าก่อนนำไปปักดำจะมีจุดเล็กๆ ลักษณะช้ำที่ขอบใบของใบล่าง ต่อมาประมาณ 7-10 วัน จุดช้ำนี้จะขยายกลายเป็นทางสีเหลืองยาวตามใบข้าว ใบที่เป็นโรคจะแห้งเร็ว และสีเขียวจะจางลงเป็นสีเทาๆ อาการในระยะปักดำจะแสดงหลังปักดำแล้วหนึ่งเดือนถึงเดือนครึ่ง ใบที่เป็นโรคขอบใบมีรอยขีดช้ำ ต่อมาจะเปลี่ยนเป็นสีเหลือง ที่แผลมีหยดน้ำสีครีมคล้ายยางสนกลมๆ ขนาดเล็กเท่าหัวเข็มหมุด ต่อมาจะกลายเป็นสีน้ำตาลและหลุดไปตามน้ำหรือฝน ซึ่งจะทำให้โรคสามารถระบาดต่อไปได้ แผลจะขยายไปตามความยาวของใบ บางครั้งขยายเข้าไปข้างในตามความกว้างของใบ ขอบแผลมีลักษณะเป็นขอบลายหยัก แผลนี้เมื่อนานไปจะเปลี่ยนเป็นสีเทา ใบที่เป็นโรคขอบใบจะแห้งและม้วนตามความยาว ในกรณีที่ต้นข้าวมีความอ่อนแอและเชื้อโรคมีปริมาณมาก จะทำให้ท่อน้ำท่ออาหารอุดตัน ต้นข้าวจะเหี่ยวเฉาและแห้งตายทั้งต้นโดยรวดเร็ว เรียกอาการนี้ว่า ครีเสก (kresek)",
    "Symptoms_ENG":"Working in progess...",
    "Protection":[
        "1.ไม่นำเมล็ดพันธุ์จากแปลงเป็นโรคมาใช้ปลูก",
        "2.ใช้พันธุ์ข้าวที่ต้านทาน เช่น พันธุ์สุพรรณบุรี 60 สุพรรณบุรี 90 สุพรรณบุรี 1 สุพรรณบุรี 2 กข 7 และ กข 23 ในสภาพดินที่อุดมสมบูรณ์สูง",
        "3.ไม่ควรใส่ปุ๋ยไนโตรเจนมาก",
        "4.ไม่ควรระบายน้ำจากแปลงที่เป็นโรคไปสู่แปลงอื่น",
        "5.ควรเฝ้าระวังการเกิดโรคถ้าปลูกข้าวพันธุ์ที่อ่อนแอต่อโรคนี้ เช่น พันธุ์ขาวดอกมะลิ 105 กข 6      เหนียวสันป่าตอง พิษณุโลก 2  ชัยนาท 1 เมื่อเริ่มพบอาการของโรคบนใบข้าว ให้ใช้สารป้องกันกำจัดโรคพืช เช่น ไอโซโพรไทโอเลน คอปเปอร์ไฮดรอกไซด์ เสตร็พโตมัยซินซัลเฟต+ออกซีเตทตราไซคลินไฮโดรคลอร์ไรด์ ไตรเบซิคคอปเปอร์ซัลเฟต"
    ],
    "Treatment":"Working in progess...",
    "Source":"shorturl.at/ghrO9"
}
Leaf_Scald_Disease = {
    "Name_TH": "โรคใบวงสีน้ำตาล",
    "Name_ENG": "Leaf Scald Disease",
    "Causation": "เชื้อรา Rhynocosporium oryzae Hashioka&Yokogi",
    "Symptoms_TH":"ระยะกล้าข้าวจะแสดงอาการไหม้ที่ปลายใบและมีสีน้ำตาลเข้ม ระยะแตกกออาการส่วนใหญ่จะเกิดบนใบ แต่มักจะเกิดแผลที่ปลายใบมากกว่าบริเวณอื่นๆ ของใบ แผลที่เกิดบนใบในระยะแรกมีลักษณะเป็นรอยช้ำ รูปไข่ยาวๆ แผลสีน้ำตาลปนเทา ขอบแผลสีน้ำตาลอ่อน จากนั้นแผลจะขยายใหญ่ขึ้นเป็นรูปวงรี ติดต่อกัน ทำให้เกิดอาการใบไหม้บริเวณกว้าง และเปลี่ยนเป็นสีฟางข้าว ในที่สุดแผลจะมีลักษณะเป็นวงซ้อนๆ กันลุกลามเข้ามาที่โคนใบ มีผลทำให้ข้าวแห้งก่อนกำหนด",
    "Symptoms_ENG":"Working in progess...",
    "Protection":[
        "1.ใช้พันธุ์ข้าวต้านทาน เช่น ในภาคตะวันออกเฉียงเหนือใช้ หางยี 71",
        "2.กำจัดพืชอาศัยของเชื้อราสาเหตุโรค",
        "3.ในแหล่งที่เคยมีโรคระบาด หรือพบแผลลักษณะอาการดังที่กล่าวข้างต้นบนใบข้าวจำนวนมาก ในระยะข้าวแตกกอ ควรฉีดพ่นสารป้องกันกำจัดโรคพืช เช่น ไธโอฟาเนทเมทิล โพรพิโคนาโซล ตามอัตราที่ระบุ"
    ],
    "Treatment":"Working in progess...",
    "Source":"http://webold.ricethailand.go.th/rkb3/title-index.php-file=content.php&id=115-1.htm"
}
Narrow_Brown_Spot_Disease = {
    "Name_TH": "โรคใบขีดสีน้ำตาล",
    "Name_ENG": "Narrow Brown Spot Disease",
    "Causation": "เชื้อรา Cercospora  oryzae I. Miyake",
    "Symptoms_TH":"ลักษณะแผลที่ใบมีสีน้ำตาลเป็นขีด ๆ ขนานไปกับเส้นใบข้าว มักพบในระยะข้าวแตกกอ แผลไม่กว้าง ตรงกลางเล็กและไม่มีรอยช้ำที่แผล ต่อมาแผลจะขยายมาติดกัน แผลจะมีมากตามใบล่างและปลายใบ ใบที่เป็นโรคจะแห้งตายจากปลายใบก่อน ต้นข้าวที่เป็นโรครุนแรงจะมีแผลสีน้ำตาลที่ข้อต่อใบได้เช่นกัน เชื้อนี้สามารถเข้าทำลายคอรวง ทำให้คอรวงเน่าและหักพับได้",
    "Symptoms_ENG":"Working in progess...",
    "Protection":[
        "1.ใช้พันธุ์ต้านทานที่เหมาะสมเฉพาะท้องที่ เช่น ภาคใต้ใช้พันธุ์แก่นจันทร์ ดอกพะยอม",
        "2.ใช้ปุ๋ยโปแตสเซียมคลอไรด์ (0-0-60) อัตรา 5-10 กิโลกรัมต่อไร่ สามารถช่วยลดความรุนแรงของโรคได้",
        "3.กรณีที่เกิดการระบาดของโรครุนแรงในระยะข้าวตั้งท้อง อาจใช้สารป้องกันกำจัดเชื้อรา เช่น คาร์เบนดาซิม ตามอัตราที่ระบุ เพื่อป้องกันการเกิดโรคเมล็ดด่าง"
    ],
    "Treatment":"Working on progess...",
    "Source":"shorturl.at/ghrO9"
}
Brown_Spot_Disease = {
    "Name_TH": "โรคใบจุดสีน้ำตาล",
    "Name_ENG": "Brown Spot Disease",
    "Causation": "เชื้อรา Bipolaris oryzae (Helminthosporium oryzae Breda de Haan.)",
    "Symptoms_TH":"โรคใบจุดสีน้ำตาลพบมากในดินที่ขาดธาตุอาหาร ซิลิคอน โพแทสเซียม แมงกานีส แมกนีเซียม และในสภาพที่ข้าวเมาตอซัง เป็นอาการของข้าวที่ได้รับผลกระทบจากกระบวนการย่อยสลายของฟางหรือตอซังเก่าที่ยังไม่สมบูรณ์  จะเกิดก็าซไฮโดรเจนซัลไฟด์ขึ้นเป็นสาเหตุที่ทำให้ข้าวเกิดอาการรากเน่าดำ ไม่สามารถดูดน้ำและธาตุอาหารจากดินได้  ต้นข้าวจึงแสดงอาการขาดธาตุอาหาร ทำให้ข้าวอ่อนแอต่อโรคใบจุดสีน้ำตาล  เชื้อรานี้เข้าทำลายข้าวได้ดีที่อุณหภูมิ 25 - 30 องศาเซลเซียส  โดยเฉพาะเมื่อข้าวเกิดความเครียดจากการขาดน้ำ การพัฒนาของโรคสามารถเกิดขึ้นได้ดีเมื่อสภาพอากาศมีความชื้นสัมพัทธ์สูง มากกว่า 80 เปอร์เซ็นต์   เชื้อราสามารถอยู่อาศัยได้ในพืชอื่นๆนอกจากข้าว ได้แก่ ข้าวบาร์เลย์  ข้าวโอ๊ต ข้าวโพด หญ้าแพรก หญ้าตีนกา และหญ้าไซ เป็นต้น",
    "Symptoms_ENG":"Working in progess..",
    "Protection":[  "1.ปรับปรุงดินโดยการไถกลบฟาง หรือเพิ่มความอุดมสมบูรณ์ดินโดยการปลูกพืชปุ๋ยสด หรือปลูกพืชหมุนเวียนเพื่อช่วยลดความรุนแรงของโรค",
                    "2.คลุกเมล็ดพันธุ์ก่อนปลูกด้วยสารป้องกันกำจัดเชื้อรา เช่น แมนโคเซบ หรือคาร์เบนดาซิม+แมนโคเซบ อัตรา 3 กรัม/เมล็ด 1 กิโลกรัม",
                    "3.ใส่ปุ๋ยโปแตสเซียมคลอไรด์ (0-0-60) อัตรา 5-10 กิโลกรัม/ไร่ ช่วยลดความรุนแรงของโรค",
                    "4.กำจัดวัชพืชในนา ดูแลแปลงให้สะอาด และใส่ปุ๋ยในอัตราที่เหมาะสม",
                    "5.ถ้าพบอาการของโรคใบจุดสีน้ำตาลรุนแรงทั่วไป 10 เปอร์เซ็นต์ของพื้นที่ใบในระยะข้าวแตกกอ หรือในระยะที่ต้นข้าวตั้งท้องใกล้ออกรวง เมื่อพบอาการใบจุดสีน้ำตาลที่ใบธงในสภาพฝนตกต่อเนื่อง อาจทำให้เกิดโรคเมล็ดด่าง ควรพ่นด้วยสารป้องกันกำจัดเชื้อรา เช่น อีดิเฟนฟอส คาร์เบนดาซิม แมนโคเซบ หรือ คาร์เบนดาซิม+แมนโคเซบ ตามอัตราที่ระบุ"
    ],
    "Treatment":"Working in progess..",
    "Source":"shorturl.at/ghrO9"
}
Dirty_Panicle_Disease = {
    "Name_TH": "โรคเมล็ดด่าง",
    "Name_ENG": "Dirty Panicle Disease",
    "Causation": "เชื้อรา Curvularia  lunata (Wakk) Boed. Cercospora  oryzae  I.Miyake. Helminthosporium  oryzae Breda de Haan. Fusarium  semitectum Berk&Rav. Trichoconispad  wickii Ganguly. Sarocladium  oryzae Sawada.",
    "Symptoms_TH":"ในระยะออกรวง พบแผลเป็นจุดสีน้ำตาลหรือดำที่เมล็ดบนรวงข้าว บางส่วนก็มีลายสีน้ำตาลดำ และบางพวกมีสีเทาปนชมพู ทั้งนี้เพราะมีเชื้อราหลายชนิดที่สามารถเข้าทำลายและทำให้เกิดอาการต่างกันไป การเข้าทำลายของเชื้อรามักจะเกิดในช่วงดอกข้าวเริ่มโผล่จากกาบหุ้มรวงจนถึงระยะเมล็ดข้าวเริ่มเป็นน้ำนม และอาการเมล็ดด่าง จะปรากฏเด่นชัดในระยะใกล้เก็บเกี่ยว",
    "Symptoms_ENG":"Woking in progess...",
    "Protection":[
        "1.ควรเฝ้าระวังการเกิดโรคถ้าปลูกข้าวพันธุ์ที่อ่อนแอต่อโรคนี้ เช่น สุพรรณบุรี 60 สุพรรณบุรี 90 พิษณุโลก 2 และข้าวเจ้าหอมคลองหลวง 1",
        "2.เมล็ดพันธุ์ที่ใช้ปลูก ควรคัดเลือกจากแปลงที่ไม่เป็นโรค",
        "3.คลุกเมล็ดพันธุ์ด้วยสารป้องกันกำจัดเชื้อรา เช่น คาร์เบนดาซิมหรือแมนโคเซบ ในอัตรา 3 กรัม/เมล็ดพันธุ์ 1 กิโลกรัม",
        "4.ในระยะที่ต้นข้าวตั้งท้องใกล้ออกรวงเมื่อพบอาการชองโรคใบจุดสีน้ำตาลที่ใบธง หรือโรคกาบใบเน่า และมีฝนตกชุก ให้ทำการป้องกันโดยพ่นสารป้องกันกำจัดเชื้อรา เช่น โพรพิโคนาโซล โพรพิโคนาโซล +ไดฟีโนโคนาโซล หรือ โพรพิโคนาโซล+โพรคลอราซ หรือ คาร์เบนดาซิม+อีพ๊อกซี่โคนาโซล หรือ    ฟูซิราซอล หรือ ทีบูโคนาโซล หรือ โพรคลอราซ+คาร์เบนดาซิม หรือ แมนโคเซบหรือ คาร์เบนดาซิม +แมนโคเซบ ตามอัตราที่ระบุ"
    ],
    "Treatment":"Working in progess",
    "Source":"shorturl.at/ghrO9"
}

dict_dict = {"Sheath Rot Disease": Sheath_Rot_Disease,
            "Sheath blight Disease":Sheath_blight_Disease,
            "Bacterial Blight Disease":Bacterial_Blight_Disease,
            "Leaf Scald Disease":Leaf_Scald_Disease,
            "Brown Spot Disease":Brown_Spot_Disease,
            "Dirty Panicle Disease":Dirty_Panicle_Disease
}

def Get_info(disease_name):
    for name in dict_dict.items():
        #print(name[0]) #name only
        if(name[0] == disease_name): #check each name
            return dict_dict[name[0]] # return result

